{"pages":[{"title":"关于我","text":"暂时还没想好，等我想好了再自我介绍吧","link":"/about/index.html"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/temptemp/hello-world.html"},{"title":"test1","text":"这是第一篇文章，但是不知道为什么是没有放置图片的文件夹呢？","link":"/temptemp/test1.html"}],"posts":[{"title":"搬校区","text":"这些文字写在搬校区之前，可以说这是我建立这个博客以来正式发布的第一篇。无意作为发刊词，只是想简单谈谈对于这个新建博客最近的一些思考。 恰好是全部搬空之后，寝室里面几乎什么也不剩下了。在这个校区即将转换的阶段，同样预示着人生阶段的转换。物理空间的变换和人生旅途的进程相互联结，真的有这么戏剧性吗？可能的确是这样的。寝室可以搬空，但是过往的种种似乎并不是就此埋葬于紫金港，而是一并搬去了华家池。这个暑假学习到的知识，在华家池仍要延续下去。而这一小小阶段的果实，又将回到紫金港进行验证。这两个阶段并不是绝对一分为二的，但似乎也不是一个渐进的转变——它更像是一种交织互生的关系。 我为什么要建立这个博客？或许只是因为我爱折腾这些在大多数人看来没有实际意义的玩意儿。文笔不佳，文思不敏，无人欣赏，顾影自怜。建立这个博客无非是在我心上贫瘠的土壤中播撒翻出几粒沉沙。但是我仍然侥幸地存有一些不切实际的希冀。 最近频繁地想到我将来的路。很不想承认，朋友之中有太多灿若繁星的浙大人了。短短大学三年就定义了四年的精彩，比如，踏入“真正”的梦想学府的人就不只一个。但这并不是我要走的路。大学三年与我而言，才刚刚开始，前面不过是基础罢了。接下来的两年才是真正的岔路口。三年之前我就想到了选择这条道路需要面对的差异，只是没想到路途差异的冲击让我差一点就迷失了方向。所幸，我借着最近的思考，仿佛触摸到了一丝裂缝中的光线。 我突然意识到5+3和5年制的差异并不是从+3之后开始算起的。专硕科硕当然有差异。对于中规中矩的我来说，真正的差异恰好就是现在，也可能稍迟一些。因为五年制需要准备考研，大抵会在寒假的时候做好考研长跑的准备。我们虽然是“保研”，但却是专硕。这也算是茫茫医学生涯中减轻的一部分，既定一个较小的目标，并把它确立下来，结果和过程相匹配。这样稳定的一致性给了我们在夹缝中一点喘息的空间。相比于优秀的学硕保研，自然不能光耀门楣；失去了考研的机会，就更不可能得到一张鱼跃龙门体验卡；和考研到专硕比，又是心有戚戚焉；同时也难与考研失利、提桶跑路、润到国外相互共情。 5+3只是5+3，至少对我而言。 唯一能做的，只有利用好这夹缝中的一点点自由的沃土，即使是长出野草，也要比散沙随风消散要好。","link":"/2022/07/16/%E6%90%AC%E6%A0%A1%E5%8C%BA/"},{"title":"华家池新宿舍连接有线网","text":"今天搬到了新的寝室，没想到插入RJ-45的网线之后不能和蓝田一样直接连上互联网。我是怎么解决的呢？ 连接有线网的好处今天搬到了新的寝室，网线的插口和蓝田不同，长在了桌面水平线之上。照例我依然使用有线网络，尽管从我使用有线网络之后本就再也没有出现无线网连接不了的状况。因为在我潜意识当中，同样是10元包月，有线网要比无线网更加稳定更加快。 不妨试验一下，分别用有线网和无线网连接Internet，登录校园网当中的测速网站（此时我已经能成功连接有线网和无线网了），结果如下 测试时间：2022/7/17 21:36 测试地点：华家池9舍 测速网站：http://speedtest.zju.edu.cn/ 无线网速度： Download下载81.53Mbps Upload上传73.48Mbps Ping延迟12.54ms Jitter抖动3.09ms 有线网速度： Download下载142.60Mbps Upload上传784.05Mbps Ping延迟7.68ms Jitter抖动0.91ms 这下的确是高下立判了，这也说明我这点折腾也算是有点意义。但是连接这个有线网还是出现了一点点问题，所以记录下来以供大家参考。 连接过程刚开始有线网连接的客户端VPN报错好像是651。我当然是看不懂的，不过我还是比较肯定我的电脑和网线都没有问题的，所以很有可能出在一些网络工程的问题上面。之前只用无线网的时候也出过类似的问题，最后只能通过连接有线网解决。可这次是有线网出了问题。 可惜我并不是科班出身。只好打电话给浙大信息技术中心的服务热线87951669。他和我说需要在“浙大学生公寓管理服务中心”的公众号iHOME入口申请IP地址。 如实填写网卡地址和手机号等待即可，接线人员和我说至少得等24小时，结果下午3点多申请的，晚上9点半看到的时候已经成功申请到了IP地址。 因为我的笔记本是没有网线接口的，所以使用了RJ-45转USB的接口，在网络设置选项里面显示的是“以太网2”。所以对应的在命令提示符cmd输入ipconfig /all后找到对应的物理地址，这就是需要填写的网卡地址。 原本我以为申请到IP地址之后就可以直接连接了，结果仍然报出了同样的错误。后来我又回想到了之前无线网不能连接的一些解决方法——修改DNS地址。（虽然不理解原理，但还是莽过去） 控制面板→网络和 Internet→网络连接 右键点击“以太网2”→状态：查看“详细信息”果然和申请得到的ip地址的一些信息不太一样。 右键点击“以太网2”→状态→属性→双击Internet协议版本4（TCP/IPv4） 然后将申请得到的ip地址，网络掩码，网关，DNS地址一个个输进去。之后确定就完事了。 果然再次到vpn客户端中就连接上了。 虽然我不太懂这个原理，但是结果成功了，也就是说明自动分配的模式不太适用于现在这个情况，只好是管理员分配了。好像大计基自学思科的那两章里面的确讲过这个玩意儿。 感想安装R包装多了，人就变得越来越依靠自己。没人会因为你是一个小白而对你特别帮助。而自我实现的乐趣，有的时候与排名比较得到的快感相比，似乎更加隐秘，更加回味无穷。","link":"/2022/07/17/%E5%8D%8E%E5%AE%B6%E6%B1%A0%E6%96%B0%E5%AE%BF%E8%88%8D%E8%BF%9E%E6%8E%A5%E6%9C%89%E7%BA%BF%E7%BD%91/"}],"tags":[{"name":"思考","slug":"思考","link":"/tags/%E6%80%9D%E8%80%83/"},{"name":"人生","slug":"人生","link":"/tags/%E4%BA%BA%E7%94%9F/"},{"name":"折腾","slug":"折腾","link":"/tags/%E6%8A%98%E8%85%BE/"}],"categories":[{"name":"日记","slug":"日记","link":"/categories/%E6%97%A5%E8%AE%B0/"}]}